POINT_A = 'Пункт А)'
DEMAND_FUNCTION = 'Функция спроса:'
MAXIMUM_PROFIT = 'Максимум прибыли равен'
CURRENCY = 'золотых'
REVERSE_DEMAND_FUNCTION = 'Обратная функция спроса:'
MARGINAL_REVENUE = 'Предельная выручка:'
MARKET_EQUILIBRIUM_QUANTITY = 'Равновесный объем продаж:'
MARKET_EQUILIBRIUM_PRICE = 'Равновесная цена:'
TOTAL_COSTS = 'Общие издержки:'
QOODS = 'лилий'
AMOUNT_DAYS = 'Данное количество лилий они смогут вырастить за'
NAME_DAYS = 'дней'
NEW_DEMAND_FUNCTION = 'Новая функция спроса:'
POINT_B = 'Пункт Б)'
POINT_C = 'Пункт В)'
NEW_REVERSE_DEMAND_FUNCTION = 'Новая обратная функция спроса:'
NEW_MARGINAL_REVENUE = 'Новая предельная выручка:'
NEW_MARKET_EQUILIBRIUM_QUANTITY = 'Новый равновесный объем продаж:'
NEW_MARKET_EQUILIBRIUM_PRICE = 'Новая равновесная цена:'
NEW_MAXIMUM_PROFIT = 'Новый максимум прибыли равен'
CHANGE_PROFIT = 'Прибыль выросла на'
TASK = '''Шрек и Фиона, поселившись на болоте, решили не сидеть без дела, и наладить продажу 
редкого вида лилий. Они открыли фирму под названием «Шрек и co» и начали планировать ее развитие.
Узнав, об этом, Осел решил помочь свои друзьям, и взял на себя доставку товара до Тридевятого королевства,
договорившись на фиксированную плату в 80 золотых. Других постоянных затрат фирма не имеет. 
Так как лилии волшебны, их выращивание отличается от выращивания обычных растений. 
Каждый день (начиная с первого) на болоте вырастает на одну лилию больше, чем в предыдущий. 
Уникальным товаром сразу заинтересовались на рынке. Функция спроса подданных Тридевятого королевства
имеет линейный вид, при цене 50 золотых они готовы покупать 150 лилий, а при цене 60 золотых, 100 лилий. 
Как оказалось, предельные издержки фирмы «Шрек и co» так же представляют линейную функцию и имеют вид
MC =2*Q-172, где Q – количество лилий.
1)	Определите равновесное состояние фирмы-монополии и максимальную прибыль
2)	За сколько дней они вырастили, данное количество лилий, если в последний день они вырастили 14 лилий
3)	Фея-крестная узнала, что уникальные кувшинки могут стать ингредиентом для ее нового зелья-молодости,
поэтому она готова купить 300 лилии, не зависимо от цены. Определите изменение функции спроса, новое рыночное
равновесие и максимальную прибыль в этой ситуации.  Определите насколько увеличилась прибыль. 
'''